# <center>Laboratorium Analiza i bazy danych </center>

## <center>Łączenie tabel, podzapytania i funkcje agregujące</center>

## Przykładowe tabele obrazujące łączenie

Do zobrazowania operacji łączenia zostaną użyte tabele:

```sql
CREATE TABLE shape_a (
    id INT PRIMARY KEY,
    shape VARCHAR (100) NOT NULL
);
 
CREATE TABLE shape_b (
    id INT PRIMARY KEY,
    shape VARCHAR (100) NOT NULL
);
```
 
Polecenie CREATE TABLE tworzy tabelę o zadanej nazwie i strukturze. Ogólna postać to:
```sql
CREATE TABLE tab_name (
    col_name1 data_type constrain,
    col_name1 data_type constrain,
    ...
);
```
Należy uzupełnić ją danymi:
```sql
INSERT INTO shape_a (id, shape)
VALUES
    (1, 'Trójkąt'),
    (2, 'Kwadrat'),
    (3, 'Deltoid'),
    (4, 'Traper');
 
INSERT INTO shape_b (id, shape)
VALUES
    (1, 'Kwadrat'),
    (2, 'Trójkąt'),
    (3, 'Romb'),
    (4, 'Równoległobok');
```
Komenda INSERT INTO pozwala na dodanie do tabeli rekordów. Ogólna postać to:

```sql
INSERT INTO tab_name (col1_name, col2_name2, ...) 
VALUES
    (val1_col1, val2_col2),
    (val2_col1, val2_col2),
    ...
```

## Inner join 

Jest to podstawowy rodzaj złączenie. Ten sposób złączenia wybiera  te wiersze, dla których warunek złączenia jest spełniony. W żadnej z łączonych tabel kolumna użyta do łączenia nie może mieć wartości NULL. 

#### Przykład:
```sql
SELECT
    a.id id_a,
    a.shape shape_a,
    b.id id_b,
    b.shape shape_b
FROM
    shape_a a
INNER JOIN shape_b b ON a.shape = b.shape;
```
W zapytaniu powyżej użyto *aliasów* nazw tabel i column wynikowych, jest to szczególnie przydatne przy długich nazwach tabel i wprowadza czytelność w zapytaniu.

#### Wynik:
|id_a|shape_a|id_b|shape_b|
|-|-|-|-|
|1|Trójkąt|2|Trójkąt|
|2|Kwadrat|1|Kwadrat|

## OUTER JOIN

Istnieją trzy rodzaje złączeń OUTER:
- LEFT OUTER JOIN,
- RIGHT OUTER JOIN,
- FULL OUTER JOIN.

### LEFT OUTER JOIN

Ten rodzaj złączenie zwróci wszystkie rekordy z lewej tablicy i dopasuje do nich rekordy z prawej tablicy które spełniją zadany warunek złączenia. Jeżeli w prawej tablicy nie występują rekordy spełnijące warunek złączenia z lewą w ich miejscu pojawią się wartości NULL.

#### Przykład 1:
```sql
SELECT
    a.id id_a,
    a.shape shape_a,
    b.id id_b,
    b.shape shape_b
FROM
    shape_a a
LEFT JOIN shape_b b ON a.shape = b.shape;
```
#### Wynik:
|id_a|shape_a|id_b|shape_b|
|-|-|-|-|
|1|Trójkąt|2|Trójkąt|
|2|Kwadrat|1|Kwadrat|
|3|Deltoid|NULL|NULL|
|4|Traper|NULL|NULL|

#### Przykład 2:
```sql
SELECT
    b.id id_b,
    b.shape shape_b,
    a.id id_a,
    a.shape shape_a   
FROM
    shape_b b
LEFT JOIN shape_a a ON a.shape = b.shape;
```
#### Wynik:
|id_a|shape_a|id_b|shape_b|
|-|-|-|-|
|1|Kwadrat|2|Kwadrat|
|2|Trójkąt|1|Trójkąt|
|3|Romb|NULL|NULL|
|4|Równoległobok|NULL|NULL|

### RIGHT OUTER JOIN

Działa jak left outer join z tym, że prawa tablica w zapytaniu jest brana w całości.

#### Przykład:
```sql
SELECT
    a.id id_a,
    a.shape shape_a,
    b.id id_b,
    b.shape shape_b
FROM
    shape_a a
RIGHT JOIN shape_b b ON a.shape = b.shape;
```

#### Wynik:
|id_a|shape_a|id_b|shape_b|
|-|-|-|-|
|2|Kwadrat|1|Kwadrat|
|1|Trójkąt|2|Trójkąt|
|NULL|NULL|3|Romb|
|NULL|NULL|4|Równoległobok|


### FULL OUTER JOIN

Jest złączeniem które zwraca:
- wiersze dla których warunek złączenia jest spełniony,
- wiersze z lewej tabeli dla których nie ma odpowiedników w prawej,
- wiersze z prawej tabeli dla których nie ma odpowiedników w lewej. 

#### Przykład:
```sql
SELECT
    a.id id_a,
    a.shape shape_a,
    b.id id_b,
    b.shape shape_b
FROM
    shape_a a
FULL JOIN shape_b b ON a.shape = b.shape;
```
|id_a|shape_a|id_b|shape_b|
|-|-|-|-|
|1|Trójkąt|2|Trójkąt|
|2|Kwadrat|1|Kwadrat|
|3|Deltoid"|NULL|NULL|
|4|Traper|NULL|NULL|
|NULL|NULL|3|Romb|
|NULL|NULL|4|Równoległobok|

## Podzapytania

Podzapytanie zagnieżdżone SELECT znajduje się wewnątrz zewnętrznego zapytania SELECT, np. po klauzuli WHERE, HAVING lub FROM. W przypadku tego rodzaju zapytań w pierwszej kolejności wykonywane są wewnętrzne zapytania SELECT, a ich wynik jest wykorzystywany do zewnętrznego zapytania SELECT. Stąd łatwo zuważyć, że mogą one służyć do poprawy wydajności obsługi zapytania. Należy dobierać podzapytania tak by najbardziej zagnieżdżone podzapytanie zawierało najmniejszy zbiór poszukiwań. 

#### Przykład:
Jeżeli chcemy znaleźć w bazie informację o tytułach filmów zwróconych w zadanym okresie możemy wykonać następujące zapytanie:
```sql
SELECT
   film_id,
   title
FROM
   film
WHERE
   film_id IN (
      SELECT
         inventory.film_id
      FROM
         rental
      INNER JOIN inventory ON inventory.inventory_id = rental.inventory_id
      WHERE
         return_date BETWEEN '2005-05-29'
      AND '2005-05-30'
   );
```

#### Wynik
|film_id|title|
|-|-|
|307|Fellowship Autumn|
|255|Driving Polish|
|388|Gunfight Moon|
|130|Celebrity Horn|
|563|Massacre Usual|
|397|Hanky October|
|...|...|

### Używanie podzapytań

Pod zapytania mogą być używane w :
- SELECT,
- UPDATE,
- DELETE,
- Funkcjach agregujących,
- Do definiowania tabel tymczasowych.

Używając podzapytań zapytania SQL szybko mogą stać się mało czytelne. Przez co będą trudne w zrozumieniu i późniejszym utrzymaniu. W celu analizy zapytań można użyć klauzuli __EXPLAIN__, która przeanalizuje zapytanie. Klauzula ta może służyć również do porównywania wydajności zapytań

#### Przykład:
```sql
EXPLAIN SELECT
   *
FROM
   film
```

## Funkcje agregujące

Funkcje agregujące wykonują obliczenia na zestawie wierszy i zwracają pojedynczy wiersz. PostgreSQL udostępnia wszystkie standardowe funkcje agregujące SQL w następujący sposób:
- AVG () - zwraca średnią wartość.
- COUNT () - zwraca liczbę wartości.
- MAX () - zwraca maksymalną wartość.
- MIN () - zwraca minimalną wartość.
- SUM () - zwraca sumę wszystkich lub różnych wartości.

Pełna lista funkcji agregującej: https://www.postgresql.org/docs/9.5/functions-aggregate.html

Często używamy funkcji agregujących z klauzulą GROUP BY w instrukcji SELECT. W tych przypadkach klauzula GROUP BY dzieli zestaw wyników na grupy wierszy i funkcja agregująca wykonuje obliczenia dla każdej grupy, np. maksimum, minimum, średnia itp. Funkcji agregujących można używać funkcji agregujących jako wyrażeń tylko w następujących klauzulach: SELECT i HAVING.

### GROUP BY
Klauzula GROUP BY dzieli wiersze zwrócone z instrukcji SELECT na grupy. Dla  każdej grupy można zastosować funkcję agregującą, np. SUM aby obliczyć sumę pozycji lub
COUNT aby uzyskać liczbę elementów w grupach.

Poniższa instrukcja ilustruje składnię klauzuli GROUP BY:
```sql
SELECT 
    column_1, 
    aggregate_function(column_2)
FROM 
    tbl_name
GROUP BY 
    column_1;
```
Klauzula GROUP BY musi pojawić się zaraz po klauzuli FROM lub WHERE, n0astępnie GROUP BY zawiera listę  kolumna oddzielonych przecinkami. 

### HAVING
Często używamy klauzuli HAVING w połączeniu z klauzulą GROUP BY do filtrowania wierszy grup
które nie spełniają określonego warunku.

Poniższa instrukcja ilustruje typową składnię klauzuli HAVING:
```sql
SELECT
    column_1,
    aggregate_function (column_2)
FROM
    tbl_name
GROUP BY
    column_1
HAVING
    condition;
```
Klauzula HAVING ustawia warunek dla wierszy grup utworzonych przez klauzulę GROUP BY.  

Klauzula GROUP BY ma zastosowanie, podczas gdy klauzula WHERE określa wcześniej warunki dla poszczególnych wierszy.

## Zadania wprowadzające
Wykonaj zapytania przy użyciu DBMS:  
  
1. Znajdź listę wszystkich filmów o tej samej długości.

In [35]:
from sqlalchemy import create_engine
import main
import pandas as pd
from IPython.display import display

db_string = "postgresql://wbauer_adb:adb2020@pgsql-196447.vipserv.org:5432/wbauer_adb"
db = create_engine(db_string)
connection = db.connect()

length = 50

request =   f"""select
                    film.title, film.length
                from
                    film
                where
                    film.length = {length}
                group by
                    film.title, film.length
                order by
                    film.length"""

data_frame = pd.read_sql_query(request, con=connection)
display(data_frame)

                title  length
0    Adaptation Holes      50
1      Blues Instinct      50
2    Crossing Divorce      50
3          Lion Uncut      50
4         Muppet Mile      50
5       Natural Stock      50
6      Pilot Hoosiers      50
7  Smoking Barbarella      50
8           Zorro Ark      50

2. Znajdź wszystkich klientów mieszkających w tym samym mieście.

In [36]:
city = "London"

request =   f"""select
                    city.city, customer.first_name, customer.last_name
                from
                    city
                inner join
                    address on address.city_id = city.city_id
                inner join
                    customer on customer.address_id = address.address_id
                where
                    city.city = '{city}'"""

data_frame = pd.read_sql_query(request, con=connection)
display(data_frame)

     city first_name last_name
0  London     Mattie   Hoffman
1  London      Cecil     Vines

3. Oblicz średni koszt wypożyczenia wszystkich filmów.

In [13]:
request =   f"""select
                    sum(film_list.price)
                from
                    film_list"""

data_frame = pd.read_sql_query(request, con=connection)
display(data_frame)

       sum
0  2969.03

4. Oblicz i wyświetl liczbę filmów we wszystkich kategoriach.

In [30]:
request =   f"""select
                    film_list.category, count(film_list.title)
                from
                    film_list
                group by
                    film_list.category
                order by
                    film_list.category"""

data_frame = pd.read_sql_query(request, con=connection)
display(data_frame)

       category  count
0        Action     64
1     Animation     66
2      Children     60
3      Classics     57
4        Comedy     58
5   Documentary     68
6         Drama     61
7        Family     69
8       Foreign     73
9         Games     61
10       Horror     56
11        Music     51
12          New     63
13       Sci-Fi     61
14       Sports     73
15       Travel     56

5. Wyświetl liczbę wszystkich klientów pogrupowanych według kraju.

In [37]:
request =   f"""select
                    customer_list.country, count(customer_list.name)
                from
                    customer_list
                group by
                    customer_list.country
                order by
                    customer_list.country"""

data_frame = pd.read_sql_query(request, con=connection)
display(data_frame)

                  country  count
0             Afghanistan      1
1                 Algeria      3
2          American Samoa      1
3                  Angola      2
4                Anguilla      1
..                    ...    ...
103               Vietnam      6
104  Virgin Islands, U.S.      1
105                 Yemen      4
106            Yugoslavia      2
107                Zambia      1

[108 rows x 2 columns]

6. Wyświetl informacje o sklepie, który ma więcej niż 100 klientów i mniej niż 300 klientów.

In [96]:
# minimalna ilość wypożyczeń to 8004 dla sklepu o id 2
request = f"""select
                    store.store_id, store.manager_staff_id, store.address_id
                from
                    store
                inner join
                    staff on store.store_id = staff.store_id
                inner join
                    rental on rental.staff_id = staff.staff_id
                group by
                    store.store_id, store.manager_staff_id, store.address_id
                having
                    count(rental.customer_id) between 100 and 300"""

data_frame = pd.read_sql_query(request, con=connection)
display(data_frame)

Empty DataFrame
Columns: [store_id, manager_staff_id, address_id]
Index: []

7. Wybierz wszystkich klientów, którzy oglądali filmy ponad 200 godzin.

In [52]:
# najwięcej klient oglądał przez 89h
sum = 60 * 200

request = f"""select
                    customer.first_name, customer.last_name, sum(film.length) as sum
                from
                    film
                inner join
                    inventory on inventory.film_id = film.film_id
                inner join
                    rental on rental.inventory_id = inventory.inventory_id
                inner join
                    customer on customer.customer_id = rental.customer_id
                group by
                    customer.first_name, customer.last_name
                having
                    sum(film.length) > {sum}
                order by
                    sum, customer.last_name, customer.first_name"""

data_frame = pd.read_sql_query(request, con=connection)
display(data_frame)

Empty DataFrame
Columns: [first_name, last_name, sum]
Index: []

8. Oblicz średnią wartość wypożyczenia filmu.

In [18]:
request =   f"""select
                    avg(film_list.price)
                from
                    film_list"""

data_frame = pd.read_sql_query(request, con=connection)
display(data_frame)

        avg
0  2.977964

9. Oblicz średnią wartość długości filmu we wszystkich kategoriach.

In [16]:
request =   f"""select
                    avg(film_list.length)
                from
                    film_list"""

data_frame = pd.read_sql_query(request, con=connection)
display(data_frame)

          avg
0  115.149448

10. Znajdź najdłuższe tytuły filmowe we wszystkich kategoriach.

In [15]:
request =   f"""select
                    film_list.category, max(film_list.length)
                from
                    film_list
                group by
                    film_list.category"""

data_frame = pd.read_sql_query(request, con=connection)
display(data_frame)

       category  max
0        Sports  184
1      Classics  184
2           New  183
3        Family  184
4        Comedy  185
5     Animation  185
6        Travel  185
7         Music  185
8         Drama  181
9        Horror  181
10       Sci-Fi  185
11        Games  185
12  Documentary  183
13      Foreign  184
14       Action  185
15     Children  178

11. Znajdź najdłuższy film we wszystkich kategoriach. Porównaj wynik z pkt 10.

In [14]:
request =   f"""select
                    max(film_list.length)
                from
                    film_list"""

data_frame = pd.read_sql_query(request, con=connection)
display(data_frame)

   max
0  185

## Zadanie implementacyjne
Zaimplementuj wszystkie funkcje w pliku main.py zgodnie z opisem a następnie przetestuj je w notatniku.

In [3]:
import main
import pandas as pd
from IPython.display import display

data_frame1 = main.film_in_category(1);
display(data_frame1)

data_frame2 = main.number_films_in_category(1)
display(data_frame2)

data_frame3 = main.number_film_by_length()
display(data_frame3)

data_frame4 = main.client_from_city("London")
display(data_frame4)

data_frame5 = main.avg_amount_by_length(50)
display(data_frame5)

data_frame6 = main.client_by_sum_length(300)
display(data_frame6)

data_frame7 = main.category_statistic_length("Horror")
display(data_frame7)

                     title               languge category
0             Amadeus Holy  English                Action
1          American Circus  English                Action
2       Antitrust Tomatoes  English                Action
3            Ark Ridgemont  English                Action
4      Barefoot Manchurian  English                Action
..                     ...                   ...      ...
59         Uprising Uptown  English                Action
60  Waterfront Deliverance  English                Action
61           Werewolf Lola  English                Action
62            Women Dorado  English                Action
63            Worst Banger  English                Action

[64 rows x 3 columns]

  category  count
0   Action     64

     length  count
0       116      4
1       184      8
2        87      6
3        71      7
4        68      5
..      ...    ...
135     148      7
136     129      7
137     130      6
138     143      7
139      58      7

[140 rows x 2 columns]

     city first_name last_name
0  London     Mattie   Hoffman
1  London      Cecil     Vines

   length       avg
0      50  3.810598

    first_name last_name   sum
0        Brian     Wyman  1265
1      Antonio      Meek  1451
2        Leona    Obrien  1588
3    Katherine    Rivera  1615
4      Tiffany    Jordan  1667
..         ...       ...   ...
594     Wesley      Bull  4808
595      Clara      Shaw  4808
596      Tammy   Sanders  5065
597    Eleanor      Hunt  5360
598       Karl      Seal  5388

[599 rows x 3 columns]

  category         avg   sum  min  max
0   Horror  112.482143  6299   48  181